# Database Programming using sqlite3

1. Perform CRUD operations on Student Table as outlined in the reference

(https://medium.com/analytics-vidhya/programming-with-databases-in-python-using-sqlite-4cecbef51ab9)

In [1]:
import sqlite3
conn = sqlite3.connect('my_database23.db')
cursor = conn.cursor()
print("opened successfully..!!!")

opened successfully..!!!

In [ ]:
conn.execute('''CREATE TABLE SCHOOL
          (ID             INT PRIMARY KEY     NOT NULL,
          NAME           TEXT    NOT NULL,
          AGE            INT     NOT NULL,
          ADDRESS        CHAR(50),
          MARKS          INT);''')

In [6]:
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (1, 'Rohan', 14, 'Delhi', 200)");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (2, 'Allen', 14, 'Bangalore', 150 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (3, 'Martha', 15, 'Hyderabad', 200 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (4, 'Palak', 15, 'Kolkata', 650)");
conn.commit()

In [2]:
for row in cursor.execute("SELECT id,name,address from school"):
    print("ID = ",row[0])
    print("NAME : ",row[1])
    print("ADDRESS : ",row[2],"\n")

ID =  1
NAME :  Rohan
ADDRESS :  Delhi

ID =  2
NAME :  Allen
ADDRESS :  Bangalore

ID =  3
NAME :  Martha
ADDRESS :  Hyderabad

ID =  4
NAME :  Palak
ADDRESS :  Kolkata

In [7]:
conn.execute("UPDATE SCHOOL SET AGE = 13  WHERE AGE = 15 ")

for i in cursor.execute("SELECT * FROM SCHOOL "):
    for j in i:
        print(j)
    print('\n')

1
Rohan
14
Delhi
200


2
Allen
14
Bangalore
150


3
Martha
13
Hyderabad
200


4
Palak
13
Kolkata
650

In [9]:
conn.execute("DELETE FROM SCHOOL WHERE NAME = 'Martha' ")

for i in cursor.execute("SELECT * FROM SCHOOL "):
    for j in i:
        print(j)
    print('\n')

1
Rohan
14
Delhi
200


2
Allen
14
Bangalore
150


4
Palak
13
Kolkata
650

2. Open the table MyRestaurants.db that you have created for NoSQL course

In [32]:
import sqlite3
food = sqlite3.connect('my_database23.db')
cursor = food.cursor()
print("opened successfully..!!!")

opened successfully..!!!

In [7]:
food.execute('''CREATE TABLE MYRESTAURANTS
         (NAME             TEXT    NOT NULL,
          FOODTYPE         TEXT,
          DISTANCE         INT,
          LASTVISIT        TEXT,
          ILIKE            INT);''')

In [11]:
food = sqlite3.connect('my_database23.db')
cursor = food.cursor()
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES ('appleleaf', 'nonveg', 15, '01-jan-2020',1)");
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES ('sowmyas','veg',18,'20-mar-2020',1 )");
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES ('thinappa','nonveg',25,'20-nov-2019',0 )");
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES ('sribhavan','veg',18,'20-dec-2019',0)");
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES('chinaworld','chinese',14,'05-mar-2020',1)");
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES('littlechina','chinese',30,'10-mar-2020',0)");
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES('munivilas','nonveg',20,'05-dec-2019',' ')");
cursor.execute("INSERT INTO MYRESTAURANTS (NAME,FOODTYPE,DISTANCE,LASTVISIT,ILIKE) \
      VALUES('dosacorner','nonveg',10,'05-feb-2020',1)");
food.commit()

3. Write a SQL query that returns all restaurants in your table MyRestaurants.db.

In [29]:
for i in cursor.execute("SELECT * FROM MYRESTAURANTS"):
    for j in i:
        print(j)
    print("\n")

appleleaf
nonveg
15
01-jan-2020
1


sowmyas
veg
18
20-mar-2020
1


thinappa
nonveg
25
20-nov-2019
0


sribhavan
veg
18
20-dec-2019
0


chinaworld
chinese
14
05-mar-2020
1


littlechina
chinese
30
10-mar-2020
0


munivilas
nonveg
20
05-dec-2019



dosacorner
nonveg
10
05-feb-2020
1

4. Write a SQL query that returns the names of restaurants in descending order that
makes Chinese foods.

In [39]:
for i in cursor.execute("SELECT NAME FROM MYRESTAURANTS WHERE FOODTYPE='chinese' ORDER BY NAME DESC"):
    print(i[0])

littlechina
chinaworld